<a href="https://colab.research.google.com/github/O-Sting/IP_projects/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2021_07_Oliver_Ngugi_Python_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import the pandas library
# 
import pandas as pd

# # Import the NUMPY library 
import numpy as np

In [ ]:
df_cells = pd.read_csv('cells_geo.csv', header=0, delimiter = ';', index_col= 0) 
df_cells.head(5)
df_cells.rename({'SITE_CODE': 'SITE_ID'}, axis=1, inplace=True)
df_cells.head(5)

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID     SITE_ID
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

In [ ]:
df_cells_desc = pd.read_csv('cells_geo_description.csv', header=0) 
df_cells_desc.head(5)

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [ ]:
# To access the urls that point to the dataset files. 
!curl http://bit.ly/Telcom_dataset1
!curl http://bit.ly/Telcom_dataset2
!curl http://bit.ly/Telcom_dataset3

<html>
<head><title>Bitly</title></head>
<body><a href="https://archive.org/download/telcomdataset/Telcom_dataset.csv">moved here</a></body>
</html><html>
<head><title>Bitly</title></head>
<body><a href="https://archive.org/download/telcomdataset2/Telcom_dataset2.csv">moved here</a></body>
</html><html>
<head><title>Bitly</title></head>
<body><a href="https://archive.org/download/telcomdataset3/Telcom_dataset3.csv">moved here</a></body>
</html>

In [ ]:

# URL to Excel file
url = 'https://archive.org/download/telcomdataset/Telcom_dataset.csv'

# Then load the first sheet of the Excel file into a data frame
dt_1 = pd.read_csv(url, header=0)

# Lastly, view the first ten rows
dt_1.head(5)

#to correct the spelling of the column names
dt_1.rename({'PRODUTC': 'PRODUCT', 'DATETIME':'DATE_TIME'}, axis=1, inplace=True)
dt_1.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# URL to Excel file with Telcom_dataset2
url = 'https://archive.org/download/telcomdataset2/Telcom_dataset2.csv'

# Then load the first sheet of the Excel file into a data frame
dt_2 = pd.read_csv(url, header=0)

# Lastly, view the first ten rows
dt_2.head(5)

#to correct the spelling of the column names
dt_2.rename({'DW_A_NUMBER': 'DW_A_NUMBER_INT'}, axis=1, inplace=True)
dt_2.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
# URL to Excel file with Telcom_dataset3
url = 'https://archive.org/download/telcomdataset3/Telcom_dataset3.csv'

# Then load the first sheet of the Excel file into a data frame
dt_3 = pd.read_csv(url, header=0)

# Lastly, view the first ten rows
dt_3.head(5)


#to correct the spelling of the column names
dt_3.rename({'CELLID': 'CELL_ID', 'SIET_ID':'SITE_ID'}, axis=1, inplace=True)
dt_3.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

the following code include the data preparation and analysis operations using the numpy and pandas libraries

In [ ]:

#to replaces a string in a value
def cellid_cln(plus_slash_str):
    return str(plus_slash_str.replace("+","").replace("/",""))



dt_1['CELL_ID'] = dt_1['CELL_ID'].map(cellid_cln)
dt_1.head(5) 


dt_1["CELL_ID"] = dt_1["CELL_ID"].str.lower()
dt_1.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e    tjnemmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e    ckzkip41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e    u0fsdahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e   cnejzstp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051khydcpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#The same is repeated for the other two datasets
dt_2['CELL_ID'] = dt_2['CELL_ID'].map(cellid_cln)
dt_2.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B    CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e   bOqkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
#and for dataset3
dt_3['CELL_ID'] = dt_3['CELL_ID'].map(cellid_cln)
dt_3.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B    CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e   38u2urfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e    ZaaZozy  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
#Merging the dataframes into a dummy dataframe foruse in the analysis part of the project
#to merge the two tables 



df_merge_1 = pd.merge(dt_1, df_cells, on='SITE_ID', how='left')
df_merge_1

df_merge_1=df_merge_1[df_merge_1['VILLES'].notnull()]
df_merge_1.head(5)

    PRODUCT  VALUE  ...          AREA   CELL_ID_y
662     sms      0  ...  CENTRE NORTH  24ccdda3d5
663     sms      0  ...  CENTRE NORTH  ebfc58af70
664     sms      0  ...  CENTRE NORTH  ba8ce6e4ef
665     sms      0  ...  CENTRE NORTH  c2545171dc
666     sms      0  ...  CENTRE NORTH  f15bd5483f

[5 rows x 20 columns]

In [ ]:

value_list = ['sms']
df_merge_2= df_merge_1[df_merge_1.VILLES.isin(value_list)]
df_merge_2

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, CELL_ON_SITE, DW_A_NUMBER_INT, DW_B_NUMBER_INT, COUNTRY_A, COUNTRY_B, CELL_ID_x, SITE_ID, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, LONGITUDE, LATITUDE, REGION, AREA, CELL_ID_y]
Index: []